Revit 2027 API
ScheduleFilter.IsIntegerValue Property
 Indicates if the filter has an integer value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsIntegerValue { get; }
Public ReadOnly Property IsIntegerValue As Boolean
	Get
public:
property bool IsIntegerValue {
	bool get ();
}
member IsIntegerValue : bool with get
Property Value
Boolean
See Also
Reference
ScheduleFilter Class
Autodesk.Revit.DB Namespace